#include <iostream>
#include <algorithm>
#include <vector>
#include <queue>
#include <assert.h>
#include <string.h>
#include <string>

#define MAX

using namespace std;

/* 문제 정의
정수 a, b -> 길이 a x 10^b인 길이 문자열
길이 문자열:
   길이 문자열은 숫자 0–9와 하이픈(‘-’)으로만 이루어진 문자열 중 다음 조건을 만족하는 것을 가리킨다.
    • ‘-’이 2개 이상 연속해서 등장하지 않는다.
    • 문자열의 첫 문자는 ‘0’이 아니다.
    • 문자열의 마지막 문자는 ‘-’이 아니다.
    • ‘-’의 다음 문자로 ‘0’이 등장하지 않는다.
    • 문자열의 숫자로만 이루어진 접미사 중 가장 긴 것을 10진법의 수로 해석하면 문자열의 길이와 같다. 이 때
    그러한 접미사가 빈 문자열이면 0으로 해석한다.
    • 문자열에 ‘-’이 등장한다면 문자열의 처음부터 가장 마지막에 등장하는 ‘-’ 앞까지의 부분 문자열이 길이 문자
    열이다.
    임의의 음이 아닌 정수 n에 대해 길이가 n인 길이 문자열은 유일하게 한 개 존재한다. 다음은 각각 길이 5, 8, 13인
    길이 문자열의 예시이다.
 */

/* 해결 알고리즘 생각

*/

/* 시간복잡도

*/

int main()
{
    /////////////input&preprocessing/////////////
    cin.tie(NULL);
    ios_base::sync_with_stdio(false);

    ///////////////////solution//////////////////

    ////////////////////output///////////////////

    return 0;
}